Revit 2027 API
CompoundStructure.GetLastCoreLayerIndex Method
 Gets the index of the last core layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetLastCoreLayerIndex()
Public Function GetLastCoreLayerIndex As Integer
public:
int GetLastCoreLayerIndex()
member GetLastCoreLayerIndex : unit -> int
Return Value
Int32
 The index of the last core layer.
Remarks
 This is the index on the interior side. You can change the shell/core layer boundary using SetNumberOfShellLayers(ShellLayerType, Int32).
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace